#+TITLE: Fine-tuning a Custom Model for Text Classification
#+AUTHOR: Claude
#+DATE: 2025-04-03
#+PROPERTY: header-args:python :session *python* :results output drawer

* Environment Setup

Let's set up our environment and configure the API client:

#+begin_src python
  # Import necessary libraries
  import os
  from dotenv import load_dotenv
  import google.generativeai as genai
  from google.generativeai import types
  import pandas as pd
  
  # Load environment variables
  load_dotenv()
  
  # Configure the client
  client = genai.configure(api_key=os.getenv("GOOGLE_API_KEY"))
  
  print("Environment configured successfully!")
#+end_src

#+RESULTS:
:results:
:end:

* Available Models

Check which models support fine-tuning:

#+begin_src python
  # Check which models support fine-tuning
  for model in client.models.list():
      if "createTunedModel" in model.supported_actions:
          print(model.name)
#+end_src

#+RESULTS:
:results:
:end:

* Load Dataset

Load the 20 Newsgroups dataset:

#+begin_src python
  from sklearn.datasets import fetch_20newsgroups
  
  # Load the 20 newsgroups dataset
  newsgroups_train = fetch_20newsgroups(subset="train")
  newsgroups_test = fetch_20newsgroups(subset="test")
  
  # View list of class names
  print("Available newsgroup categories:")
  print(newsgroups_train.target_names)
#+end_src

#+RESULTS:
:results:
:end:

* Define Preprocessing Functions

Define functions to preprocess the newsgroup data:

#+begin_src python
  import email
  import re
  
  def preprocess_newsgroup_row(data):
      # Extract only the subject and body
      msg = email.message_from_string(data)
      text = f"{msg['Subject']}\n\n{msg.get_payload()}"
      # Strip any remaining email addresses
      text = re.sub(r"[\w\.-]+@[\w\.-]+", "", text)
      # Truncate the text to fit within the input limits
      text = text[:40000]
      return text
  
  def preprocess_newsgroup_data(newsgroup_dataset):
      # Put data points into dataframe
      df = pd.DataFrame(
          {"Text": newsgroup_dataset.data, "Label": newsgroup_dataset.target}
      )
      # Clean up the text
      df["Text"] = df["Text"].apply(preprocess_newsgroup_row)
      # Match label to target name index
      df["Class Name"] = df["Label"].map(lambda l: newsgroup_dataset.target_names[l])
      return df
  
  print("Preprocessing functions defined successfully!")
#+end_src

#+RESULTS:
:results:
:end:

